# vim:ft=ruby:

# tap "caskroom/cask"
# tap "caskroom/fonts"
# tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# Core
brew "openssl"
brew "git"
brew "git-lfs"
brew "fish"
brew "gnupg"
brew "wget"
brew "curl"
brew "coreutils"

# Languages
brew "go"
brew "node"

# Utilities
brew "tmux"
brew "mas"
brew "protobuf"
brew "protoc-gen-go"
brew "hugo"
brew "derailed/k9s/k9s"


# Applications
cask "1password"
cask "adobe-creative-cloud"
cask "alfred"
cask "authy"
cask "bartender"
cask "gitkraken"
cask "google-backup-and-sync"
cask "google-chrome"
cask "iterm2"
cask "keepingyouawake"
cask "postman"
cask "slack"
cask "visual-studio-code"
cask "Dropbox"
cask "keybase"
cask "firefox"
cask "docker"
cask "gpg-suite"
cask "spotify"
cask "font-fira-code"


