# vim:ft=ruby:

# tap "caskroom/cask"
# tap "caskroom/fonts"
# tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap 'homebrew/cask-fonts'

# Core
brew "mackup"
brew "openssl"
brew "git"
brew "gnupg"
brew "wget"
brew "curl"
brew "coreutils"
brew 'bash' # Latest Bash version
brew 'jq'

# Languages
brew "go"
brew "node"

# Utilities
brew "tmux"
brew "mas"
brew "protobuf"
brew "protoc-gen-go"
brew "hugo"
brew "gh"
cask "google-cloud-sdk"
brew "tailscale"


# Applications
cask "1password"
cask "raycast"
cask "authy"
cask "bartender"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "slack"
cask "visual-studio-code"
# cask "Dropbox"
cask "keybase"
cask "firefox"
cask "docker"
cask "gpg-suite"
cask "spotify"
cask "font-fira-code"
cask "wireshark"
cask "notion"
cask "loom"
cask "warp"
cask "orbstack"
cask "notion-calendar"
cask "linear-linear"
cask "microsoft-remote-desktop"


# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-fira-code'

# Requires sudo access so last
cask "adobe-creative-cloud"